       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOOK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "book.cpy".
       PROCEDURE DIVISION.
           DISPLAY M_PI.
           STOP RUN.
