       IDENTIFICATION DIVISION.
       PROGRAM-ID. C05EX02 AS "Capitulo 5 – Exemplo 2".
       PROCEDURE DIVISION.
       PROG-PRINCIPAL-PARA.
           CALL "C0502MEN".
           STOP RUN.
