       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCRAIZ.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION RZENESI.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WS-BAS PIC 9(3)V9(5) VALUE 2.
       77  WS-IND PIC 9(3)V9(5) VALUE 3.
       77  WS-EXP PIC 9(3)V9(5) VALUE 4.
       77  WS-RST PIC 9(7)V9(5).
       77  WS-RES PIC Z(6)9.9(5).
       PROCEDURE DIVISION.
       PROG-PRINCIPAL-PARA.
           MOVE RZENESI(WS-BAS, WS-IND, WS-EXP) TO WS-RES.
           DISPLAY FUNCTION TRIM(WS-RES).
           STOP RUN.
       END PROGRAM CALCRAIZ.
