       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAP05AP07.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION FIB2
           FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WS-NUM PIC 9(3).
       77  WS-FIB PIC Z(38)9.
       PROCEDURE DIVISION.
       PROG-PRINCIPAL-PARA.
           ACCEPT WS-NUM.
           MOVE FIB2(WS-NUM) TO WS-FIB.
           DISPLAY TRIM(WS-FIB).
           STOP RUN.
       END PROGRAM CAP05AP07.
