       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAP05AP05.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION FAT5
           FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WS-NUM PIC 9(2).
       77  WS-FAT PIC Z(38).
       PROCEDURE DIVISION.
       PROG-PRINCIPAL-PARA.
           ACCEPT WS-NUM.
           MOVE FAT5(WS-NUM) TO WS-FAT.
           DISPLAY TRIM(WS-FAT).
           STOP RUN.
       END PROGRAM CAP05AP05.
