       PROGRAM-ID. FAT1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  AC-CI       PIC 9(4).
       77  WS-C-FAT    PIC 9(8) VALUE 1.
       LINKAGE SECTION.
       77  LK-E-NUMERO PIC 9(4).
       77  LK-S-FAT    PIC Z(7)9.
       PROCEDURE DIVISION USING LK-E-NUMERO, LK-S-FAT.
       PROG-PRINCIPAL-PARA.
           PERFORM VARYING AC-CI FROM 1 BY 1 UNTIL AC-CI > LK-E-NUMERO
              COMPUTE WS-C-FAT = WS-C-FAT * AC-CI
           END-PERFORM.
           MOVE WS-C-FAT TO LK-S-FAT.
           EXIT PROGRAM.
