       PROGRAM-ID. FAT3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  AC-CI       PIC 9(4).
       LINKAGE SECTION.
       77  LK-E-NUMERO PIC 9(4).
       77  LK-C-FAT    PIC 9(8).
       PROCEDURE DIVISION USING LK-C-FAT, LK-E-NUMERO.
       PROG-PRINCIPAL-PARA.
           PERFORM VARYING AC-CI FROM 1 BY 1 UNTIL AC-CI > LK-E-NUMERO
              COMPUTE LK-C-FAT = LK-C-FAT * AC-CI
           END-PERFORM.
           EXIT PROGRAM.
