       IDENTIFICATION DIVISION.
       FUNCTION-ID. FAT4.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       77  LS-NUM PIC 9(2).
       LINKAGE SECTION.
       77  LK-NUM PIC 9(2).
       77  LK-FAT PIC 9(38).
       PROCEDURE DIVISION USING BY VALUE LK-NUM RETURNING LK-FAT.
       PROG-PRINCIPAL-PARA.
           IF LK-NUM = 0
              COMPUTE LK-FAT = 1
           ELSE
              COMPUTE LS-NUM = LK-NUM - 1
              COMPUTE LK-FAT = LK-NUM * NUMVAL(FAT4(LS-NUM))
           END-IF
           GOBACK.
       END FUNCTION FAT4.
