       IDENTIFICATION DIVISION.
       FUNCTION-ID. FATBASE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       77  LS-NUM PIC 99.
       77  LS-PAR PIC 9(38).
       LINKAGE SECTION.
       77  LK-NUM PIC 99.
       77  LK-PAR PIC 9(38).
       77  LK-FAT PIC 9(38).
       PROCEDURE DIVISION USING BY VALUE LK-NUM, LK-PAR
       RETURNING LK-FAT.
       PROG-PRINCIPAL-PARA.
           IF LK-NUM = 0
              COMPUTE LK-FAT = LK-PAR
           ELSE
              COMPUTE LS-NUM = LK-NUM - 1
              COMPUTE LS-PAR = LK-NUM * LK-PAR
              COMPUTE LK-FAT = NUMVAL(FATBASE(LS-NUM, LS-PAR))
           END-IF
           GOBACK.
       END FUNCTION FATBASE.
