       IDENTIFICATION DIVISION.
       FUNCTION-ID. FIB2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION FIBBASE
           FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       77  LS-ANT PIC 9(38).
       77  LS-ATU PIC 9(38).
       77  LS-NUM PIC 9(38).
       LINKAGE SECTION.
       77  LK-NUM PIC 9(3).
       77  LK-FIB PIC 9(38).
       PROCEDURE DIVISION USING BY VALUE LK-NUM RETURNING LK-FIB.
       PROG-PRINCIPAL-PARA.
           MOVE 0 TO LS-ANT.
           MOVE 1 TO LS-ATU.
           MOVE LK-NUM TO LS-NUM.
           COMPUTE LK-FIB = NUMVAL(FIBBASE(LS-NUM, LS-ANT, LS-ATU)).
           GOBACK.
       END FUNCTION FIB2.
