       IDENTIFICATION DIVISION.
       FUNCTION-ID. RZENESI.
       DATA DIVISION.
       LINKAGE SECTION.
       77  LK-BAS PIC 9(3)V9(5).
       77  LK-IND PIC 9(3)V9(5).
       77  LK-EXP PIC 9(3)V9(5).
       77  LK-RST PIC 9(7)V9(5).
       PROCEDURE DIVISION USING BY VALUE LK-BAS, LK-IND, LK-EXP
       RETURNING LK-RST.
       PROG-PRINCIPAL-PARA.
           COMPUTE LK-RST = LK-BAS ** (LK-EXP / LK-IND).
           EXIT FUNCTION.
       END FUNCTION RZENESI.
