       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALOMUNDO.
       PROCEDURE DIVISION.
       PRINCIPAL                       SECTION.
           DISPLAY "ALO, MUNDO!".
           STOP RUN.
