       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALOMUNDO.

       PROCEDURE DIVISION.
       PRINCIPAL                       SECTION.
       PROG-PRINCIPAL-PARA.
           DISPLAY "ALO, MUNDO!".
           STOP RUN.
