       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALOMUNDO.
       PROCEDURE DIVISION.
       PROG-PRINCIPAL-PARA.
           DISPLAY "ALO, MUNDO!".
           STOP RUN.
