       IDENTIFICATION DIVISION.
       FUNCTION-ID. RMVCHAR.
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       77  LS-PTR     PIC 9(3).
       77  LS-IND     PIC 9(3).
       77  LS-CTR     PIC 9(3).
       77  LS-CAD-ENT PIC X(256).
       LINKAGE SECTION.
       77  LK-CAD-ENT PIC X(256).
       77  LK-TAM     PIC 9(3).
       77  LK-CARACTR PIC X.
       77  LK-CAD-SAI PIC X(256).
       PROCEDURE DIVISION USING BY VALUE LK-CAD-ENT, LK-TAM, LK-CARACTR
       RETURNING LK-CAD-SAI.
       PROG-PRINCIPAL-PARA.
           MOVE LK-CAD-ENT TO LS-CAD-ENT
           INSPECT LS-CAD-ENT CONVERTING LK-CARACTR TO LOW-VALUE
           MOVE 1 TO LS-PTR LS-IND
           PERFORM UNTIL LS-PTR > LK-TAM
              UNSTRING LS-CAD-ENT DELIMITED ALL LOW-VALUE
                 INTO LK-CAD-SAI(LS-IND:) COUNT IN LS-CTR
                 WITH POINTER LS-PTR
              ADD LS-CTR TO LS-IND
           END-PERFORM.
       END FUNCTION RMVCHAR.
